<template>
	<view>
		<view v-if="type == 2" class="rich-box">
			<rich-text :nodes="string"></rich-text>
		</view>
		<view v-if="type == 1" class="faq-box">
			<view class="q-text"># 画头酱是什么？</view>
			<view class="a-text">画头酱是一个根据关键词ai生成头像的工具。</view>

			<view class="q-text"># 关键词如何填写？</view>
			<view class="a-text">AI会根据输入的关键词作画，如果AI作画后的图不是您想要的效果，试着添加更多关键词，详细更详细描述您想要的效果，比如猫 > 黄色的猫 > 黄色的猫，在桌子上
				>黄色的猫，在桌子上，看着窗外。添加更多关键词，会让绘画的效果更接近自己想要的样子。关键词可任意填写中文或英文，中间用逗号“，”隔开。</view>

			<view class="q-text"># 技巧</view>
			<view class="a-text">在括号“（）”内填写关键词则为强调，括号数越多，权重越高。 例如关键词组：“狗，（猫），（（兔子））”，意为关键词权重，兔子＞猫＞狗。</view>
			<view class="a-text">在中括号“[] ”内填写关键词则为避免，括号数越多，权重越低。 例如关键词组：“狗，[猫]，[[兔子]]”，意为关键词权重，狗＞猫＞兔子。</view>
			<view class="a-text">关键词尽量不选用单独的形容词或副词，形容词或副词应搭配具体名词或动词使用。 例如关键词组：“白色，头发，快速，跑步”，可改为“白色头发，快速跑步”。</view>
			<view class="a-text">关键词尽量不选同类型连词或复杂词汇，最好分开使用。 例如关键词组：“黄色和绿色眼睛”，可改为“黄色眼睛，绿色眼睛”。
				又例如关键词组：“一个蓝色的带盖玻璃杯”，可改为“蓝色玻璃杯，杯盖”。</view>

			<u-divider text="部分关键词参考"></u-divider>

			<view class="q-text"># 画风</view>
			<view class="a-text">素描，厚涂，水彩画，钢笔画，粗线条，写实，chibi（Q版）</view>

			<view class="q-text"># 场景</view>
			<view class="a-text">雪，繁星，夜晚，白天，咖啡馆，草坪，战场，山脉，雨天，晴天，落叶，斑驳的阳光，极光，星空，街道，赛博朋克城市，圣诞树，水下，废墟，树屋，风景，教室，贫民窟。</view>

			<view class="q-text"># 其他</view>
			<view class="a-text">渲染，蓝色/白色背景，蒸汽朋克汽车，花瓣，苹果树，哥特式建筑，古风建筑，喷泉。</view>

		</view>
	</view>

</template>
<script>
	export default {
		data() {
			return {
				string: '',
				type: '1'
			}
		},
		created() {},
		onLoad({ type }) {
			this.type = type
			if (type == 1) {
				uni.setNavigationBarTitle({ title: '使用帮助' })
			}
			if (type == 2) {
				this.string = `<p>欢迎您访问我们的产品。在使用画头酱提供的AI作画体验服务（以下简称“本服务”）前，请您务必仔细阅读并理解透彻本《免责声明》（以下简称“本声明”）。&nbsp;请您知悉，如果您选择继续使用本服务，意味着您充分知悉并接受以下使用条件：&nbsp;<br>
1.本服务处于前沿探索阶段，测试体验功能仅供学术目的使用，未经许可，请勿分享、传播输入及生成的文本、图片等内容。&nbsp;<br>
2.使用本服务请确保自定义输入文本等内容未侵害他人权益，同时请勿输入政治相关及违反公序良俗、法律法规的内容。&nbsp;<br>
3.您确认并知悉当前体验服务生成的所有内容都是由人工智能模型生成，我们对其生成内容的准确性、完整性和功能性不做任何保证，并且其生成的内容不代表我们的态度或观点。我们的服务来自于法律法规允许的包括但不限于公开互联网等信息积累，已经过不断的自动及人工敏感数据过滤，但仍不排除其中部分信息具有瑕疵、不合理或会引发不快。遇有此情形的，欢迎并感谢您随时向通过本平台所提供的方式举报。<br>
4.在同意接受本声明之前，具体的使用规范请严格按照下方《服务使用协议》的内容。此外，无论是否实际阅读本声明，&nbsp;您通过网络页面点击确认同意本声明或实际使用本平台（“我方”）提供的本服务，&nbsp;均表示您与我方已就本声明达成一致并同意接受本声明的全部约定内容。如果您不同意本声明的任意内容，或者无法准确理解我方对本声明条款的解释，请不要同意或使用本服务。否则，表示您已接受了以下所述的条款和条件，同意受本声明约束。&nbsp;<br>
5.我们尊重并保护所有使用本服务用户的个人隐私，但郑重提醒用户：您确认使用本服务时输入的内容将不包含您的个人信息，如因输入个人信息产生的一切后续问题由您自行负责。<br>
6.您理解并且同意，为持续改善本服务，除有相反证明，您使用本服务上传、发布或传输内容即代表您有权且同意在全世界范围内，永久性的、不可撤销的、免费授予我方及其关联方的全部产品或服务对该内容的存储、使用、发布、复制、修改、改编、出版、翻译、据以创作衍生作品、传播、表演和展示等权利；将内容的全部或部分编入其他任何形式的作品、媒体、技术中的权利；对您的上传、&nbsp;发布的内容进行商业开发的权利及其相关宣传和推广等服务的权利；以及再授权给其他第三方以上述方式使用的权利。&nbsp;</p>

<p>服务使用协议&nbsp;<br>
1.您承诺，严格依照本声明使用本服务，并且不会利用本服务进行任何违法或不当的活动，发布、传送或分享含有下列内容之一的信息：&nbsp;<br>
(1)&nbsp;反对宪法所确定的基本原则的；&nbsp;<br>
(2)&nbsp;危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；&nbsp;<br>
(3)&nbsp;损害国家荣誉和利益的；&nbsp;<br>
(4)&nbsp;煽动民族仇恨、民族歧视、破坏民族团结的；&nbsp;<br>
(5)&nbsp;破坏国家宗教政策，宣扬邪教和封建迷信的；&nbsp;<br>
(6)&nbsp;散布谣言，扰乱社会秩序，破坏社会稳定的；&nbsp;<br>
(7)&nbsp;散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；&nbsp;<br>
(8)&nbsp;侮辱或者诽谤他人，侵害他人合法权利的；&nbsp;<br>
(9)&nbsp;含有虚假、诈骗、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；&nbsp;<br>
(10)&nbsp;含有中国或其您所在国国家管辖法所适用的法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的。&nbsp;您应当对使用本服务是否符合法律法规规定进行必要审查，并由您承担由此产生的所有责任。您确认并同意，&nbsp;我方不会因为本服务或您使用本服务违反上述约定，而需要承担任何责任。&nbsp;<br>
2.您使用本服务不得侵害他人权益（包括但不限于著作权、专利权、商标权等知识产权与其他权益）。&nbsp;同时，您同意并承诺，您使用本服务所提供、使用的文本内容已获得了充分、必要且有效的合法许可及授权。&nbsp;<br>
3.您同意并承诺，在使用本服务时，不会披露任何保密、敏感或个人信息。&nbsp;<br>
4.您同意并承诺，本服务以及因使用本服务所取得的任何产出或成果，仅限您本人用于学术测试目的，未经我方事前书面同意，&nbsp;您不得将本服务以及前述产出或成果用于任何商业或其他目的与用途，且不得自行或透过他人以任何方式或载体向第三方披露、提供、转发、传播或公开。&nbsp;<br>
5.您理解并同意，基于本服务产生的知识产权与相关权益，均归我方或我方关联公司所有。&nbsp;<br>
6.您应理解并同意，本服务仅处于体验、试用阶段，尚存在不完备性，我方不对任何服务可用性、可靠性做出任何承诺。&nbsp;我方不对您使用本服务或本服务结果承担任何责任，且本服务结果不代表我方立场。&nbsp;<br>
7.我方有权因为业务发展或法律法规的变动而随时对本服务的内容和/或提供方式进行变动，或者暂停或终止本服务。您同意我方将不对因上述情况导致的任何后果，向您或第三方承担任何责任。&nbsp;<br>
8.在任何情况下，我方均不就因本服务所发生的任何直接性、间接性、后果性、惩戒性、偶然性、特殊性的损害&nbsp;(包括但不限于：您使用本服务而遭受的利润损失)，承担任何责任(即使您已事先被告知该等损害发生的可能性)。&nbsp;<br>
9.若您违反本声明任何约定，则我方有权随时单方面终止本声明，且我方无需承担任何责任。同时，我方有权根据实际损失向您要求赔偿。 &nbsp;<br>
10.除双方另有约定外，本声明之解释与适用，以及与本声明有关的争议，均依照中华人民共和国法律予以处理(不包含冲突法) ，并由我方所在地有管辖权的人民法院管辖。</p>`
				uni.setNavigationBarTitle({ title: '服务协议' })
			}
		},
		methods: {}
	}
</script>
<style lang="scss" scoped>
	.rich-box,
	.faq-box {
		padding: 10px;
		background-color: #fff;
		line-height: 30px;
	}

	.q-text {
		color: #55AAFF;
		font-size: 18px;
		font-weight: 700;
		margin-bottom: -5px;
	}

	.a-text {
		padding: 10px;
		background-color: #F8FAFB;
		border-radius: 8px;
		margin: 20px 0;
	}
</style>
